import { expect, describe, it } from "vitest"
import { doMove } from "../logic/game-logic"

describe('doMove', () => {
    it('ход игрока с фишкой 1 в колонку, где есть только одна свободная ячейка', () => {
        const board = [
            [0, 0, 1, 2, 1, 2, 1],
            [2, 0, 2, 1, 2, 1, 2],
            [1, 0, 1, 2, 1, 2, 1],
            [2, 0, 2, 1, 2, 1, 2],
            [1, 0, 1, 2, 1, 2, 1],
            [2, 0, 2, 1, 2, 1, 2]
        ]

        doMove(board, 1, 0, 0)

        expect(board).toEqual([
            [1, 0, 1, 2, 1, 2, 1],
            [2, 0, 2, 1, 2, 1, 2],
            [1, 0, 1, 2, 1, 2, 1],
            [2, 0, 2, 1, 2, 1, 2],
            [1, 0, 1, 2, 1, 2, 1],
            [2, 0, 2, 1, 2, 1, 2]
        ])
    })

    it('ход игрока с фишкой 1 в полностью свободную колонку', () => {
        const board = [
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0]
        ]

        doMove(board, 1, 5, 2)

        expect(board).toEqual([
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 1, 0, 0, 0, 0]
        ])
    })

    it('ход игрока с фишкой 2 в колонку с уже тремя заполненными ячейками', () => {
        const board = [
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0],
            [1, 0, 0, 0, 0, 0, 0],
            [2, 0, 0, 0, 0, 0, 0],
            [1, 0, 0, 0, 0, 0, 0]
        ]

        doMove(board, 2, 2, 0)

        expect(board).toEqual([
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0],
            [2, 0, 0, 0, 0, 0, 0],
            [1, 0, 0, 0, 0, 0, 0],
            [2, 0, 0, 0, 0, 0, 0],
            [1, 0, 0, 0, 0, 0, 0]
        ])
    })

    it('ход игрока с фишкой 1 в колонку с пропуском между ячейками', () => {
        const board = [
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0],
            [1, 0, 0, 0, 0, 0, 0],
            [2, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0], 
            [1, 0, 0, 0, 0, 0, 0]
        ]

        doMove(board, 1, 4, 0)

        expect(board).toEqual([
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0],
            [1, 0, 0, 0, 0, 0, 0],
            [2, 0, 0, 0, 0, 0, 0],
            [1, 0, 0, 0, 0, 0, 0], 
            [1, 0, 0, 0, 0, 0, 0]
        ])
    })

    it('ход игрока с фишкой 1 в колонку заполненную четыремя фишками', () => {
        const board = [
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 1],
            [0, 0, 0, 0, 0, 0, 2],
            [0, 0, 0, 0, 0, 0, 1],
            [0, 0, 0, 0, 0, 0, 2]
        ]

        doMove(board, 1, 1, 6)

        expect(board).toEqual([
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 1],
            [0, 0, 0, 0, 0, 0, 1],
            [0, 0, 0, 0, 0, 0, 2],
            [0, 0, 0, 0, 0, 0, 1],
            [0, 0, 0, 0, 0, 0, 2]
        ])
    })

    it('ход игрока с фишкой 2 в полностью пустую колонку', () => {
        const board = [
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0]
        ]

        doMove(board, 2, 5, 4)

        expect(board).toEqual([
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 2, 0, 0]
        ])
    })

    it('ход игрока с фишкой 2 в колонку с одной оставшейся свободной ячейкой', () => {
        const board = [
            [0, 0, 0, 0, 0, 0, 0],
            [1, 0, 0, 0, 0, 0, 0],
            [2, 0, 0, 0, 0, 0, 0],
            [1, 0, 0, 0, 0, 0, 0],
            [2, 0, 0, 0, 0, 0, 0],
            [1, 0, 0, 0, 0, 0, 0]
        ]

         doMove(board, 2, 0, 0)

        expect(board).toEqual([
            [2, 0, 0, 0, 0, 0, 0],
            [1, 0, 0, 0, 0, 0, 0],
            [2, 0, 0, 0, 0, 0, 0],
            [1, 0, 0, 0, 0, 0, 0],
            [2, 0, 0, 0, 0, 0, 0],
            [1, 0, 0, 0, 0, 0, 0]
        ])
    })

    it('ход игрока с фишкой 2 в колонку с пропуском между фишками', () => {
        const board = [
            [0, 0, 0, 0, 0, 0, 0],
            [1, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0],
            [2, 0, 0, 0, 0, 0, 0],
            [1, 0, 0, 0, 0, 0, 0],
            [2, 0, 0, 0, 0, 0, 0]
        ]

        doMove(board, 1, 2, 0)

        expect(board).toEqual([
            [0, 0, 0, 0, 0, 0, 0],
            [1, 0, 0, 0, 0, 0, 0],
            [1, 0, 0, 0, 0, 0, 0],
            [2, 0, 0, 0, 0, 0, 0],
            [1, 0, 0, 0, 0, 0, 0],
            [2, 0, 0, 0, 0, 0, 0]
        ])
    })

    it('ход игрока с фишкой 1 в полностью пустую колонку в центре доски', () => {
        const board = [
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0]
        ]

        doMove(board, 1, 5, 3)

        expect(board).toEqual([
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 1, 0, 0, 0]
        ])
    })
})
